In [2]:
import sqlite3
from pprint import pprint

In [22]:
conn = sqlite3.connect('../data/db/chinook.db')
c = conn.cursor()
param = ('Nancy',)
c.execute('SELECT * FROM employees WHERE FirstName = ?', param)
print(c.fetchall())
conn.close()

[(2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com')]

In [12]:
conn = sqlite3.connect('../data/db/chinook.db')
c = conn.cursor()
tables_query = "select name from sqlite_master where type = 'table'"
schema_query = "select sql from sqlite_master where type = 'table' and name = 'albums'"

c.execute(tables_query)
pprint(c.fetchall())
c.execute(schema_query)
pprint(c.fetchall())
conn.close()

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]
[('CREATE TABLE "albums"\r\n'
  '(\r\n'
  '    [AlbumId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n'
  '    [Title] NVARCHAR(160)  NOT NULL,\r\n'
  '    [ArtistId] INTEGER  NOT NULL,\r\n'
  '    FOREIGN KEY ([ArtistId]) REFERENCES "artists" ([ArtistId]) \r\n'
  '\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n'
  ')',)]

In [27]:
db = sqlite3.connect('../data/db/chinook.db')
c = db.cursor()

sql = 'select e.FirstName, e.LastName, m.FirstName, m.LastName from employees e left join employees m on e.ReportsTo = m.EmployeeId'
c.execute(sql).fetchall()

[('Andrew', 'Adams', None, None),
 ('Nancy', 'Edwards', 'Andrew', 'Adams'),
 ('Jane', 'Peacock', 'Nancy', 'Edwards'),
 ('Margaret', 'Park', 'Nancy', 'Edwards'),
 ('Steve', 'Johnson', 'Nancy', 'Edwards'),
 ('Michael', 'Mitchell', 'Andrew', 'Adams'),
 ('Robert', 'King', 'Michael', 'Mitchell'),
 ('Laura', 'Callahan', 'Michael', 'Mitchell')]

In [28]:
import pandas as pd
df = pd.read_sql(sql, db)
df

  FirstName  LastName FirstName  LastName
0    Andrew     Adams      None      None
1     Nancy   Edwards    Andrew     Adams
2      Jane   Peacock     Nancy   Edwards
3  Margaret      Park     Nancy   Edwards
4     Steve   Johnson     Nancy   Edwards
5   Michael  Mitchell    Andrew     Adams
6    Robert      King   Michael  Mitchell
7     Laura  Callahan   Michael  Mitchell

# Zadania

Korzystając z bazy `chinook.db` rozwiąż zadania.

1. Wyświetl tytuły albumów dostępnych w sklepie w kolejności alfabetycznej.
2. Wyświetl imię, nazwisko i tytuł pracownika. Listę posortuj w malejąco po nazwisku.
3. Ile albumów jest dostępnych w sklepie?
4. Jaka jest średnia długość utworu sprzedawanego w sklepie?
5. Ile trwa najkrótszy utwór w dostępny w sklepie sklepie?
6. Jaki jest najdłuższy utwór w dostępny w sklepie?
7. Utwórów którego artysty jest najwięcej w sklepie?
8. Który pracownik opiekuje się największą liczbą klientów?
9. Ile wynosi najwyższa kwota na fakturze?
10. Który klient wydał w sklepie najmniej pieniędzy?
11. Jaki jest tytuł utworu, który najlepiej się sprzedaje?
12. Jaki jest tytuł albumu z którego sprzedało się najwięcej piosenek?
13. Wyświetl imię i nazwisko pracownika oraz przypisanego mu kierownika.
14. Jakiego gatunku utworów jest najwięcej w sklepie?
15. Jaki artysta posiada najmniej utworów w sklepie?
16. Wyświetl utwory wraz z kwotą jaką "zarobiły" dla sklepu.
17. Wyświetl listę tytułów albumów i sumę jaką zarobiły dla sklepu począwszy od tego, który zarobił najwięcej.